Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dal176.h
#define _SRCON0F_SR0F4_POSITION                  0x00000004
#define _SRCON0F_SR0F4_MASK                      0x00000010
#define _SRCON0F_SR0F4_LENGTH                    0x00000001

#define _SRCON0F_SR0F5_POSITION                  0x00000005
#define _SRCON0F_SR0F5_MASK                      0x00000020
#define _SRCON0F_SR0F5_LENGTH                    0x00000001

#define _SRCON0F_SR0F8_POSITION                  0x00000008
#define _SRCON0F_SR0F8_MASK                      0x00000100
#define _SRCON0F_SR0F8_LENGTH                    0x00000001

#define _SRCON0F_SR0F12_POSITION                 0x0000000C
#define _SRCON0F_SR0F12_MASK                     0x00001000
#define _SRCON0F_SR0F12_LENGTH                   0x00000001

#define _SRCON0F_SR0F13_POSITION                 0x0000000D
#define _SRCON0F_SR0F13_MASK                     0x00002000
#define _SRCON0F_SR0F13_LENGTH                   0x00000001

#define _SRCON1F_SR1F0_POSITION                  0x00000000
#define _SRCON1F_SR1F0_MASK                      0x00000001
#define _SRCON1F_SR1F0_LENGTH                    0x00000001

#define _SRCON1F_SR1F1_POSITION                  0x00000001
#define _SRCON1F_SR1F1_MASK                      0x00000002
#define _SRCON1F_SR1F1_LENGTH                    0x00000001

#define _SRCON1F_SR1F2_POSITION                  0x00000002
#define _SRCON1F_SR1F2_MASK                      0x00000004
#define _SRCON1F_SR1F2_LENGTH                    0x00000001

#define _SRCON1F_SR1F3_POSITION                  0x00000003
#define _SRCON1F_SR1F3_MASK                      0x00000008
#define _SRCON1F_SR1F3_LENGTH                    0x00000001

#define _SRCON1F_SR1F4_POSITION                  0x00000004
#define _SRCON1F_SR1F4_MASK                      0x00000010
#define _SRCON1F_SR1F4_LENGTH                    0x00000001

#define _SRCON1F_SR1F5_POSITION                  0x00000005
#define _SRCON1F_SR1F5_MASK                      0x00000020
#define _SRCON1F_SR1F5_LENGTH                    0x00000001

#define _SRCON1F_SR1F8_POSITION                  0x00000008
#define _SRCON1F_SR1F8_MASK                      0x00000100
#define _SRCON1F_SR1F8_LENGTH                    0x00000001

#define _SRCON1F_SR1F12_POSITION                 0x0000000C
#define _SRCON1F_SR1F12_MASK                     0x00001000
#define _SRCON1F_SR1F12_LENGTH                   0x00000001

#define _SRCON1F_SR1F13_POSITION                 0x0000000D
#define _SRCON1F_SR1F13_MASK                     0x00002000
#define _SRCON1F_SR1F13_LENGTH                   0x00000001

#define _ANSELG_ANSG6_POSITION                   0x00000006
#define _ANSELG_ANSG6_MASK                       0x00000040
#define _ANSELG_ANSG6_LENGTH                     0x00000001

#define _ANSELG_ANSG7_POSITION                   0x00000007
#define _ANSELG_ANSG7_MASK                       0x00000080
#define _ANSELG_ANSG7_LENGTH                     0x00000001

#define _ANSELG_ANSG8_POSITION                   0x00000008
#define _ANSELG_ANSG8_MASK                       0x00000100
#define _ANSELG_ANSG8_LENGTH                     0x00000001

#define _ANSELG_ANSG9_POSITION                   0x00000009
#define _ANSELG_ANSG9_MASK                       0x00000200
#define _ANSELG_ANSG9_LENGTH                     0x00000001

#define _ANSELG_ANSG15_POSITION                  0x0000000F
#define _ANSELG_ANSG15_MASK                      0x00008000
#define _ANSELG_ANSG15_LENGTH                    0x00000001

#define _ANSELG_w_POSITION                       0x00000000
#define _ANSELG_w_MASK                           0xFFFFFFFF
#define _ANSELG_w_LENGTH                         0x00000020

#define _TRISG_TRISG0_POSITION                   0x00000000
#define _TRISG_TRISG0_MASK                       0x00000001
#define _TRISG_TRISG0_LENGTH                     0x00000001

#define _TRISG_TRISG1_POSITION                   0x00000001
#define _TRISG_TRISG1_MASK                       0x00000002
#define _TRISG_TRISG1_LENGTH                     0x00000001

#define _TRISG_TRISG6_POSITION                   0x00000006
#define _TRISG_TRISG6_MASK                       0x00000040
#define _TRISG_TRISG6_LENGTH                     0x00000001

#define _TRISG_TRISG7_POSITION                   0x00000007
#define _TRISG_TRISG7_MASK                       0x00000080
#define _TRISG_TRISG7_LENGTH                     0x00000001

#define _TRISG_TRISG8_POSITION                   0x00000008
#define _TRISG_TRISG8_MASK                       0x00000100
#define _TRISG_TRISG8_LENGTH                     0x00000001

#define _TRISG_TRISG9_POSITION                   0x00000009
#define _TRISG_TRISG9_MASK                       0x00000200
#define _TRISG_TRISG9_LENGTH                     0x00000001

#define _TRISG_TRISG12_POSITION                  0x0000000C
#define _TRISG_TRISG12_MASK                      0x00001000
#define _TRISG_TRISG12_LENGTH                    0x00000001

#define _TRISG_TRISG13_POSITION                  0x0000000D
#define _TRISG_TRISG13_MASK                      0x00002000
#define _TRISG_TRISG13_LENGTH                    0x00000001

#define _TRISG_TRISG14_POSITION                  0x0000000E
#define _TRISG_TRISG14_MASK                      0x00004000
#define _TRISG_TRISG14_LENGTH                    0x00000001

#define _TRISG_TRISG15_POSITION                  0x0000000F
#define _TRISG_TRISG15_MASK                      0x00008000
#define _TRISG_TRISG15_LENGTH                    0x00000001

#define _TRISG_w_POSITION                        0x00000000
#define _TRISG_w_MASK                            0xFFFFFFFF
#define _TRISG_w_LENGTH                          0x00000020

#define _PORTG_RG0_POSITION                      0x00000000
#define _PORTG_RG0_MASK                          0x00000001
#define _PORTG_RG0_LENGTH                        0x00000001

#define _PORTG_RG1_POSITION                      0x00000001
#define _PORTG_RG1_MASK                          0x00000002
#define _PORTG_RG1_LENGTH                        0x00000001

#define _PORTG_RG6_POSITION                      0x00000006
#define _PORTG_RG6_MASK                          0x00000040
#define _PORTG_RG6_LENGTH                        0x00000001

