Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dal176.h
#define _SDHCINTSTAT_BWRDYIF_POSITION            0x00000004
#define _SDHCINTSTAT_BWRDYIF_MASK                0x00000010
#define _SDHCINTSTAT_BWRDYIF_LENGTH              0x00000001

#define _SDHCINTSTAT_BRRDYIF_POSITION            0x00000005
#define _SDHCINTSTAT_BRRDYIF_MASK                0x00000020
#define _SDHCINTSTAT_BRRDYIF_LENGTH              0x00000001

#define _SDHCINTSTAT_CARDIIF_POSITION            0x00000006
#define _SDHCINTSTAT_CARDIIF_MASK                0x00000040
#define _SDHCINTSTAT_CARDIIF_LENGTH              0x00000001

#define _SDHCINTSTAT_CARDRIF_POSITION            0x00000007
#define _SDHCINTSTAT_CARDRIF_MASK                0x00000080
#define _SDHCINTSTAT_CARDRIF_LENGTH              0x00000001

#define _SDHCINTSTAT_CARDIF_POSITION             0x00000008
#define _SDHCINTSTAT_CARDIF_MASK                 0x00000100
#define _SDHCINTSTAT_CARDIF_LENGTH               0x00000001

#define _SDHCINTSTAT_EIF_POSITION                0x0000000F
#define _SDHCINTSTAT_EIF_MASK                    0x00008000
#define _SDHCINTSTAT_EIF_LENGTH                  0x00000001

#define _SDHCINTSTAT_CTOEIF_POSITION             0x00000010
#define _SDHCINTSTAT_CTOEIF_MASK                 0x00010000
#define _SDHCINTSTAT_CTOEIF_LENGTH               0x00000001

#define _SDHCINTSTAT_CCRCEIF_POSITION            0x00000011
#define _SDHCINTSTAT_CCRCEIF_MASK                0x00020000
#define _SDHCINTSTAT_CCRCEIF_LENGTH              0x00000001

#define _SDHCINTSTAT_CEBEIF_POSITION             0x00000012
#define _SDHCINTSTAT_CEBEIF_MASK                 0x00040000
#define _SDHCINTSTAT_CEBEIF_LENGTH               0x00000001

#define _SDHCINTSTAT_CIDXEIF_POSITION            0x00000013
#define _SDHCINTSTAT_CIDXEIF_MASK                0x00080000
#define _SDHCINTSTAT_CIDXEIF_LENGTH              0x00000001

#define _SDHCINTSTAT_DTOEIF_POSITION             0x00000014
#define _SDHCINTSTAT_DTOEIF_MASK                 0x00100000
#define _SDHCINTSTAT_DTOEIF_LENGTH               0x00000001

#define _SDHCINTSTAT_DCRCEIF_POSITION            0x00000015
#define _SDHCINTSTAT_DCRCEIF_MASK                0x00200000
#define _SDHCINTSTAT_DCRCEIF_LENGTH              0x00000001

#define _SDHCINTSTAT_DEBEIF_POSITION             0x00000016
#define _SDHCINTSTAT_DEBEIF_MASK                 0x00400000
#define _SDHCINTSTAT_DEBEIF_LENGTH               0x00000001

#define _SDHCINTSTAT_CLEIF_POSITION              0x00000017
#define _SDHCINTSTAT_CLEIF_MASK                  0x00800000
#define _SDHCINTSTAT_CLEIF_LENGTH                0x00000001

#define _SDHCINTSTAT_ACEIF_POSITION              0x00000018
#define _SDHCINTSTAT_ACEIF_MASK                  0x01000000
#define _SDHCINTSTAT_ACEIF_LENGTH                0x00000001

#define _SDHCINTSTAT_ADEIF_POSITION              0x00000019
#define _SDHCINTSTAT_ADEIF_MASK                  0x02000000
#define _SDHCINTSTAT_ADEIF_LENGTH                0x00000001

#define _SDHCINTEN_CCIE_POSITION                 0x00000000
#define _SDHCINTEN_CCIE_MASK                     0x00000001
#define _SDHCINTEN_CCIE_LENGTH                   0x00000001

#define _SDHCINTEN_TXCIE_POSITION                0x00000001
#define _SDHCINTEN_TXCIE_MASK                    0x00000002
#define _SDHCINTEN_TXCIE_LENGTH                  0x00000001

#define _SDHCINTEN_BGIE_POSITION                 0x00000002
#define _SDHCINTEN_BGIE_MASK                     0x00000004
#define _SDHCINTEN_BGIE_LENGTH                   0x00000001

#define _SDHCINTEN_DMAIE_POSITION                0x00000003
#define _SDHCINTEN_DMAIE_MASK                    0x00000008
#define _SDHCINTEN_DMAIE_LENGTH                  0x00000001

#define _SDHCINTEN_BWRDYIE_POSITION              0x00000004
#define _SDHCINTEN_BWRDYIE_MASK                  0x00000010
#define _SDHCINTEN_BWRDYIE_LENGTH                0x00000001

#define _SDHCINTEN_BRRDYIE_POSITION              0x00000005
#define _SDHCINTEN_BRRDYIE_MASK                  0x00000020
#define _SDHCINTEN_BRRDYIE_LENGTH                0x00000001

#define _SDHCINTEN_CARDIIE_POSITION              0x00000006
#define _SDHCINTEN_CARDIIE_MASK                  0x00000040
#define _SDHCINTEN_CARDIIE_LENGTH                0x00000001

#define _SDHCINTEN_CARDRIE_POSITION              0x00000007
#define _SDHCINTEN_CARDRIE_MASK                  0x00000080
#define _SDHCINTEN_CARDRIE_LENGTH                0x00000001

#define _SDHCINTEN_CARDIE_POSITION               0x00000008
#define _SDHCINTEN_CARDIE_MASK                   0x00000100
#define _SDHCINTEN_CARDIE_LENGTH                 0x00000001

#define _SDHCINTEN_EIE_POSITION                  0x0000000F
#define _SDHCINTEN_EIE_MASK                      0x00008000
#define _SDHCINTEN_EIE_LENGTH                    0x00000001

#define _SDHCINTEN_CTOEIE_POSITION               0x00000010
#define _SDHCINTEN_CTOEIE_MASK                   0x00010000
#define _SDHCINTEN_CTOEIE_LENGTH                 0x00000001

#define _SDHCINTEN_CCRCEIE_POSITION              0x00000011
#define _SDHCINTEN_CCRCEIE_MASK                  0x00020000
#define _SDHCINTEN_CCRCEIE_LENGTH                0x00000001

#define _SDHCINTEN_CEBEIE_POSITION               0x00000012
#define _SDHCINTEN_CEBEIE_MASK                   0x00040000
#define _SDHCINTEN_CEBEIE_LENGTH                 0x00000001

#define _SDHCINTEN_CIDXEIE_POSITION              0x00000013
#define _SDHCINTEN_CIDXEIE_MASK                  0x00080000
#define _SDHCINTEN_CIDXEIE_LENGTH                0x00000001

#define _SDHCINTEN_DTOEIE_POSITION               0x00000014
#define _SDHCINTEN_DTOEIE_MASK                   0x00100000
#define _SDHCINTEN_DTOEIE_LENGTH                 0x00000001

#define _SDHCINTEN_DCRCEIE_POSITION              0x00000015
#define _SDHCINTEN_DCRCEIE_MASK                  0x00200000
#define _SDHCINTEN_DCRCEIE_LENGTH                0x00000001

#define _SDHCINTEN_DEBEIE_POSITION               0x00000016
#define _SDHCINTEN_DEBEIE_MASK                   0x00400000
#define _SDHCINTEN_DEBEIE_LENGTH                 0x00000001

#define _SDHCINTEN_CLEIE_POSITION                0x00000017
#define _SDHCINTEN_CLEIE_MASK                    0x00800000
#define _SDHCINTEN_CLEIE_LENGTH                  0x00000001

#define _SDHCINTEN_ACEIE_POSITION                0x00000018
#define _SDHCINTEN_ACEIE_MASK                    0x01000000
#define _SDHCINTEN_ACEIE_LENGTH                  0x00000001

#define _SDHCINTEN_ADEIE_POSITION                0x00000019
#define _SDHCINTEN_ADEIE_MASK                    0x02000000
#define _SDHCINTEN_ADEIE_LENGTH                  0x00000001

