Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/include/proc/p32mz1025dal176.h
#define _SBT5RD2_GROUP3_POSITION                 0x00000003
#define _SBT5RD2_GROUP3_MASK                     0x00000008
#define _SBT5RD2_GROUP3_LENGTH                   0x00000001

#define _SBT5WR2_GROUP0_POSITION                 0x00000000
#define _SBT5WR2_GROUP0_MASK                     0x00000001
#define _SBT5WR2_GROUP0_LENGTH                   0x00000001

#define _SBT5WR2_GROUP1_POSITION                 0x00000001
#define _SBT5WR2_GROUP1_MASK                     0x00000002
#define _SBT5WR2_GROUP1_LENGTH                   0x00000001

#define _SBT5WR2_GROUP2_POSITION                 0x00000002
#define _SBT5WR2_GROUP2_MASK                     0x00000004
#define _SBT5WR2_GROUP2_LENGTH                   0x00000001

#define _SBT5WR2_GROUP3_POSITION                 0x00000003
#define _SBT5WR2_GROUP3_MASK                     0x00000008
#define _SBT5WR2_GROUP3_LENGTH                   0x00000001

#define _SBT5REG3_SIZE_POSITION                  0x00000003
#define _SBT5REG3_SIZE_MASK                      0x000000F8
#define _SBT5REG3_SIZE_LENGTH                    0x00000005

#define _SBT5REG3_PRI_POSITION                   0x00000009
#define _SBT5REG3_PRI_MASK                       0x00000200
#define _SBT5REG3_PRI_LENGTH                     0x00000001

#define _SBT5REG3_BASE_POSITION                  0x0000000A
#define _SBT5REG3_BASE_MASK                      0xFFFFFC00
#define _SBT5REG3_BASE_LENGTH                    0x00000016

#define _SBT5RD3_GROUP0_POSITION                 0x00000000
#define _SBT5RD3_GROUP0_MASK                     0x00000001
#define _SBT5RD3_GROUP0_LENGTH                   0x00000001

#define _SBT5RD3_GROUP1_POSITION                 0x00000001
#define _SBT5RD3_GROUP1_MASK                     0x00000002
#define _SBT5RD3_GROUP1_LENGTH                   0x00000001

#define _SBT5RD3_GROUP2_POSITION                 0x00000002
#define _SBT5RD3_GROUP2_MASK                     0x00000004
#define _SBT5RD3_GROUP2_LENGTH                   0x00000001

#define _SBT5RD3_GROUP3_POSITION                 0x00000003
#define _SBT5RD3_GROUP3_MASK                     0x00000008
#define _SBT5RD3_GROUP3_LENGTH                   0x00000001

#define _SBT5WR3_GROUP0_POSITION                 0x00000000
#define _SBT5WR3_GROUP0_MASK                     0x00000001
#define _SBT5WR3_GROUP0_LENGTH                   0x00000001

#define _SBT5WR3_GROUP1_POSITION                 0x00000001
#define _SBT5WR3_GROUP1_MASK                     0x00000002
#define _SBT5WR3_GROUP1_LENGTH                   0x00000001

#define _SBT5WR3_GROUP2_POSITION                 0x00000002
#define _SBT5WR3_GROUP2_MASK                     0x00000004
#define _SBT5WR3_GROUP2_LENGTH                   0x00000001

#define _SBT5WR3_GROUP3_POSITION                 0x00000003
#define _SBT5WR3_GROUP3_MASK                     0x00000008
#define _SBT5WR3_GROUP3_LENGTH                   0x00000001

#define _SBT5REG4_SIZE_POSITION                  0x00000003
#define _SBT5REG4_SIZE_MASK                      0x000000F8
#define _SBT5REG4_SIZE_LENGTH                    0x00000005

#define _SBT5REG4_PRI_POSITION                   0x00000009
#define _SBT5REG4_PRI_MASK                       0x00000200
#define _SBT5REG4_PRI_LENGTH                     0x00000001

#define _SBT5REG4_BASE_POSITION                  0x0000000A
#define _SBT5REG4_BASE_MASK                      0xFFFFFC00
#define _SBT5REG4_BASE_LENGTH                    0x00000016

#define _SBT5RD4_GROUP0_POSITION                 0x00000000
#define _SBT5RD4_GROUP0_MASK                     0x00000001
#define _SBT5RD4_GROUP0_LENGTH                   0x00000001

#define _SBT5RD4_GROUP1_POSITION                 0x00000001
#define _SBT5RD4_GROUP1_MASK                     0x00000002
#define _SBT5RD4_GROUP1_LENGTH                   0x00000001

#define _SBT5RD4_GROUP2_POSITION                 0x00000002
#define _SBT5RD4_GROUP2_MASK                     0x00000004
#define _SBT5RD4_GROUP2_LENGTH                   0x00000001

#define _SBT5RD4_GROUP3_POSITION                 0x00000003
#define _SBT5RD4_GROUP3_MASK                     0x00000008
#define _SBT5RD4_GROUP3_LENGTH                   0x00000001

#define _SBT5WR4_GROUP0_POSITION                 0x00000000
#define _SBT5WR4_GROUP0_MASK                     0x00000001
#define _SBT5WR4_GROUP0_LENGTH                   0x00000001

#define _SBT5WR4_GROUP1_POSITION                 0x00000001
#define _SBT5WR4_GROUP1_MASK                     0x00000002
#define _SBT5WR4_GROUP1_LENGTH                   0x00000001

#define _SBT5WR4_GROUP2_POSITION                 0x00000002
#define _SBT5WR4_GROUP2_MASK                     0x00000004
#define _SBT5WR4_GROUP2_LENGTH                   0x00000001

#define _SBT5WR4_GROUP3_POSITION                 0x00000003
#define _SBT5WR4_GROUP3_MASK                     0x00000008
#define _SBT5WR4_GROUP3_LENGTH                   0x00000001

#define _SBT6ELOG1_CMD_POSITION                  0x00000000
#define _SBT6ELOG1_CMD_MASK                      0x00000007
#define _SBT6ELOG1_CMD_LENGTH                    0x00000003

#define _SBT6ELOG1_REGION_POSITION               0x00000004
#define _SBT6ELOG1_REGION_MASK                   0x000000F0
#define _SBT6ELOG1_REGION_LENGTH                 0x00000004

#define _SBT6ELOG1_INITID_POSITION               0x00000008
#define _SBT6ELOG1_INITID_MASK                   0x0000FF00
#define _SBT6ELOG1_INITID_LENGTH                 0x00000008

#define _SBT6ELOG1_CODE_POSITION                 0x00000018
#define _SBT6ELOG1_CODE_MASK                     0x0F000000
#define _SBT6ELOG1_CODE_LENGTH                   0x00000004

#define _SBT6ELOG1_MULTI_POSITION                0x0000001F
#define _SBT6ELOG1_MULTI_MASK                    0x80000000
#define _SBT6ELOG1_MULTI_LENGTH                  0x00000001

#define _SBT6ELOG2_GROUP_POSITION                0x00000000
#define _SBT6ELOG2_GROUP_MASK                    0x00000003
#define _SBT6ELOG2_GROUP_LENGTH                  0x00000002

#define _SBT6ECON_ERRP_POSITION                  0x00000018
#define _SBT6ECON_ERRP_MASK                      0x01000000
#define _SBT6ECON_ERRP_LENGTH                    0x00000001

#define _SBT6ECLRS_CLEAR_POSITION                0x00000000
#define _SBT6ECLRS_CLEAR_MASK                    0x00000001
#define _SBT6ECLRS_CLEAR_LENGTH                  0x00000001

